Revit 2015 API
ExternalDefinitonCreationOptions.Description Property
 The description of the parameter definition to be created. The description will be used as tooltip in the Revit UI including in the properties palette. The default is an empty string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public string Description { get; set; }
Visual Basic
Public Property Description As String
	Get
	Set
Visual C++
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
ExternalDefinitonCreationOptions Class
Autodesk.Revit.DB Namespace